УТ/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КонтролироватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КонтролируемаяПартия</name>
    <type>
      <types>CatalogRef.КонтролируемыеПартии</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ/src/CommonModules/АУ_ПолучениеДанныхСервер/Module.bsl
#Область Интерфейс

Функция ПолучитьСтруктуруОтвета() Экспорт
	
	Результат=Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("Данные");
	Результат.Вставить("КодОшибки");
	Результат.Вставить("ТекстОшибки");
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьОшибкуДляВозврата(Ответ,КодОшибки,ТекстОшибки) Экспорт
	
	Ответ.Результат=Ложь;
	Ответ.КодОшибки=КодОшибки;
	Ответ.ТекстОшибки=ТекстОшибки;
	
	Возврат Ответ;
	
КонецФункции

Функция ВернутьОстаткиТоваровНаСкладах(ПараметрыЗапроса) Экспорт
	
	Ответ=ПолучитьСтруктуруОтвета();
	
	Запрос=Новый Запрос;
	МассивСкладов=Новый Массив;
	Если ПараметрыЗапроса.Свойство("Склады") Тогда
		Запрос.УстановитьПараметр("ВсеСклады",Ложь);
		Для каждого стрСклад Из ПараметрыЗапроса.Склады Цикл
			Склад=Справочники.Склады.НайтиПоКоду(стрСклад);
			Если ЗначениеЗаполнено(Склад) Тогда
				МассивСкладов.Добавить(Склад);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Запрос.УстановитьПараметр("ВсеСклады",Истина);
	КонецЕсли;
	Запрос.УстановитьПараметр("Склады",МассивСкладов);
	Запрос.УстановитьПараметр("ДатаОстатков",ПрочитатьДатуJSON(ПараметрыЗапроса.Дата,ФорматДатыJSON.ISO));
	
	Запрос.Текст="ВЫБРАТЬ
	             |	ТоварыНаСкладахОстатки.Склад.Наименование КАК Склад,
	             |	ТоварыНаСкладахОстатки.Номенклатура.Код КАК Номенклатура,
	             |	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Количество
	             |ИЗ
	             |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	             |			&ДатаОстатков,
	             |			Склад В (&Склады)
	             |				ИЛИ &ВсеСклады) КАК ТоварыНаСкладахОстатки
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ТоварыНаСкладахОстатки.Склад.Наименование,
	             |	ТоварыНаСкладахОстатки.Номенклатура.Код";
	
	Массив=Новый Массив;
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Данные=Новый Структура;
		Данные.Вставить("Склад",Выборка.Склад);
		Данные.Вставить("Номенклатура",Выборка.Номенклатура);
		Данные.Вставить("Количество",Выборка.Количество);
		Массив.Добавить(Данные);
		
	КонецЦикла;
	
	Ответ.Результат=Истина;
	Ответ.Данные=Массив;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти
